let height = 6;
let width = 5;
let tileSize = 70;
let guessList;
let word;

// Словник слів для кожної кількості літер
function getWordListBySliderValue(sliderValue) {
    switch (sliderValue) {
        case 1:
            return {"а": "Літера А", "б": "Літера Б", "в": "Літера В", "г": "Літера Г", "ґ": "Літера Ґ", "д": "Літера Д", "е": "Літера Е", "є": "Літера Є", "ж": "Літера Ж", "з": "Літера З", "и": "Літера И", "і": "Літера І", "ї": "Літера Ї", "й": "Літера Й", "к": "Літера К", "л": "Літера Л", "м": "Літера М", "н": "Літера Н", "о": "Літера О", "п": "Літера П", "р": "Літера Р", "с": "Літера С", "т": "Літера Т", "у": "Літера У", "ф": "Літера Ф", "х": "Літера Х", "ц": "Літера Ц", "ч": "Літера Ч", "ш": "Літера Ш", "щ": "Літера Щ", "ь": "Знак м’якшення", "ю": "Літера Ю", "я": "Літера Я"};
        case 2:
            return { "аа": "Назва багатьох річок у Данії, Німеччині, Нідерландах, Швейцарії, Прибалтиці", "ад": "Місце, де душі грішників після смерті віддаються вічним мукам", "аз": "Первісні, початкові відомості, основи чого-небудь", "ар": "У метричній системі — міра земельнї площі, що дорівнює 100 м²", "ас": "Великий майстер, чудовий фахівець", "бо": "Японська бойова палиця", "го": "Стародавня китайська стратегічна настільна гра для двох гравців", "до": "Перша з семи назв нот", "ля": "Шоста з семи назв нот", "ме": "Могутні сили, що правлять світом у шумерській міфології", "мо": "в'єтнамський музичний ударний інструмент", "мі": "Третя з семи назв нот", "оз": "казкова країна з книги «Чарівник країни Оз»", "ом": "Одиниця електричного опору", "па": "Окремий рух, танцювальний крок", "ра": "В давньоєгипетській міфології — бог Сонця, перший правитель Єгипту", "ре": "Друга з семи назв нот", "са": "Парамілітарні формування Націонал-соціалістичної робітничої партії Німеччини у період з 1921 по 1945 рік", "сі": "Сьома з семи назв нот", "фа": "Четверта з семи назв нот", "щі": "Рідка страва, рід супу з капусти або щавлю, шпинату", "юз": "Літеродрукувальний телеграфний апарат", "яв": "Реальна дійсність - не сон, не мрія, не марення", "яд": "Речовина, що викликає отруєння", "яз": "Пристрій у вигляді плоту, частоколу впоперек річки або затоки з ворітьми, в які вставляють вершу чи ятір для ловлі риби", "як": "Велика жуйна рогата тварина", "ял": "Однощогла робоча або навчальна корабельна шлюпка, коротка і широка, що має від однієї до декількох пар весел", "ям": "Поштова станція, де проїжджаючі міняли коней", "яр": "Глибока довга западина, що утворилася внаслідок розмиву пухких осадових порід тимчасовими потоками"};
        case 3:
            return {"абд": "Слуга, раб", "акт": "Окремий прояв якої-небудь діяльності - дія, подія, вчинок", "ара": "Довгохвостий папуга з яскравим оперенням, поширений у Південній Африці", "бак": "Велика закрита металева посудина для рідини", "бал": "Великий вечір з танцями", "бар": "Невеликий ресторан, в якому напої і закуски споживають біля стойки буфету або за столиками", "бас": "Струнний або духовий музичний інструмент з низьким ладом", "бах": "Звуконаслідування, що означає звук від удару, пострілу", "бек": "Титул людей знатного походження, князів або начальників невеликих племен, урядових осіб і військових", "бик": "Велика свійська рогата тварина, самець корови", "бич": "Те, що завдає великої шкоди, лиха", "боа": "Велика змія з родини удавів, що водиться в тропічних країнах", "бот": "Невелике веслове, парусне (звичайно з однією щоглою) або моторне судно", "бра": "Настінний свічник або держак для лампи", "буй": "Сигнальний плавок на річці, озері для позначення мілизни, підводних каменів, рибальських сіток", "бук": "Листяне дерево з гладкою сірою корою і міцною деревиною", "бум": "Уживається як наслідування звуку від пострілу, удару дзвона, барабана", "бур": "Інструмент для буріння свердловин у ґрунті та різних гірських породах", "бут": "Будівельний камінь, що використовується головно для фундаменту", "біб": "Однорічна городня рослина, що має в стручках поживні плоди", "біг": "Спортивний вид фізичних вправ, що полягають у швидкому пересуванні по доріжці стадіону або в природних умовах по пересіченій місцевості", "бік": "Яка-небудь сторона, стінка, площина предмета", "бір": "Сосновий або інший шпильковий ліс; також мішаний ліс з переважанням сосни", "вал": "Кількість продукції, зробленої за певний період і вираженої в вартості, у вихідних показниках", "вік": "Період тривалістю сто років", "віл": "Кастрований бик, якого використовують як тяглову силу", "газ": "Речовина, здатна поширюватися в усьому доступному для неї просторі, рівномірно заповнюючи його", "гай": "Невеликий, переважно листяний, ліс", "гол": "Очко, яке виграє команда, забивши м'яч або шайбу в чужі ворота", "гра": "Діяльність людини з моделювання іншого виду діяльності з розважальною чи навчальною метою", "дах": "Верхня частина будівлі, що служить її покриттям; покрівля", "дим": "Суміш дрібних твердих частинок і газуватих продуктів, які виділяються в повітря зі згорянням чого-небудь", "душ": "Водолікувальна або гігієнічна процедура, за якої водяний струмінь діє на тіло людини", "дід": "Чоловік похилого віку", "дія": "Робота, діяльність, здійснення чого-небудь", "ера": "Великий історичний період, епоха", "ерг": "Одиниця роботи або енергії, що дорівнює роботі, виконаній силою в одну дину на шляху в один сантиметр", "зоб": "Розширена нижня частина стравоходу, у якій тимчасово перебуває та попередньо перетравлюється їжа", "зуб": "Кісткове утворення в ротовій порожнині хребетних тварин, використовуються для розкушування і пережовування їжі", "зір": "Одне з п'яти почуттів, органом якого є око", "їжа": "Те, що їдять і п'ють", "кат": "Той, хто здійснює смертні вироки або тілесне покарання, бере на тортури", "кий": "Довга пряма палиця для гри в більярд, один кінець якої тонший, а другий – грубший", "кит": "Найбільший морський ссавець, схожий на рибу", "код": "Система умовних знаків або сигналів для передачі, обробки і зберігання інформації", "кін": "Місце, куди кладуть ставку в азартній грі", "кіт": "Cвійська тварина родини котячих, що знищує мишей і щурів", "лад": "Стан, коли все робиться, виконується як слід, відповідно до певних вимог, правил", "лак": "Прозорий розчин природних або синтетичних плівкоутворювачів у спирті, скипидарі, олії, з домішками пластифікаторів та інших речовин, яким покривають яку-небудь поверхню для її захисту та надання блиску", "лев": "Великий хижий звір родини котячих із короткою жовтою шерстю і довгою пишною гривою у самців", "лей": "Грошова одиниця Румунії та Молдови", "лин": "Прісноводна риба родини коропових із товстим слизьким тілом", "лоб": "Верхня надочна частина обличчя людини або морди тварини", "лом": "Товстий загострений з одного кінця металевий стрижень, яким ламають, розбивають що-небудь тверде", "лук": "Ручна зброя для метання стріл, яка має форму стягнутої тятивою дуги", "ліс": "Велика площа землі, заросла деревами і кущами", "мак": "Трав'яниста рослина з довгим стеблом і великими квітками, що дає кулястий плід, наповнений дрібним насінням", "мед": "Густа солодка маса, яку бджоли виробляють з нектару квітів", "меч": "Старовинна холодна зброя у вигляді двосічного прямого довгого клинка з рукояткою", "мир": "Стан спокою та відсутності протистоянь, зокрема збройних конфліктів між державами", "мис": "Частина суші, яка гострим кутом входить у водний простір", "мох": "Сланка спорова рослина без коріння та квітів, що росте у вогких місцях, на деревах, камінні", "низ": "Нижня частина предмета", "ніж": "Різальний інструмент, який складається з клинка — смуги твердого матеріалу на одній або декількох сторонах", "ніс": "Орган нюху, який знаходиться на обличчі людини, на морді тварини", "ніч": "Частина доби від заходу до сходу сонця, з вечора до ранку", "око": "Орган зору", "орк": "Злісна, агресивна міфічна істота, людиноподібний монстр", "пал": "Дуже сильне тепло, що йде від чого-небудь нагрітого або розжареного", "піч": "Споруда з цегли або каменю для опалення приміщення, випікання хліба", "раб": "Людина, яка була позбавлена будь-яких прав і засобів виробництва й перебувала у повній власності рабовласника", "рак": "Покрита панцером безхребетна прісноводна тварина із великими клішнями біля голови і черевцем, схожим на хвіст", "рів": "Довга глибока канава, розмита водою або викопана в землі", "ріг": "Твердий кістковий наріст, що звужується до кінця", "рік": "Одиниця літочислення, проміжок часу, близький до періоду одного обертання Землі навколо Сонця", "сад": "Спеціально відведена значна площа землі, на якій вирощують плодові дерева, кущі", "син": "Особа чоловічої статі стосовно своїх батьків", "сон": "Фізіологічний стан спокою організму людини і тварини", "суд": "Державний орган, що здійснює правосуддя", "січ": "Окреме містечко, що входило до складу козацької організації у 16–18 столітті", "тин": "Огорожа, сплетена з лози, тонкого гілля", "тло": "Основний колір, тон, на якому зроблено або робиться малюнок, візерунок", "фах": "Основна кваліфікація, спеціальність", "цап": "Самець кози", "цеп": "Ряд бійців чи стрільців, розташованих на певній відстані один від одного", "цех": "Об'єднання ремісників однієї чи близьких спеціальностей за феодалізму", "ціп": "Ручне знаряддя для молотьби, що складається з довгого держака і прикріпленого до нього ременем або мотузком короткого дерев'яного бича", "чай": "Південна вічнозелена рослина, із висушеного і спеціально обробленого листя якої приготовляють ароматний напій", "час": "Одна з основних об'єктивних форм існування матерії, яка виявляється в тривалості буття", "чин": "Службовець того або іншого службового розряду", "чос": "Дорога з асфальтовим покриттям", "чур": "Те ж саме, що і джерело", "шиб": "Заглибина, свердловина, шахта", "юга": "Сніжна буря, завірюха, хурделиця", "юка": "Південна вічнозелена деревна рослина родини лілійних з довгим колючим листям і жовтувато-білими квітками", "яма": "Заглиблення в землі", "ямб": "У силабо-тонічному віршуванні — двоскладова стопа з наголосом на другому складі", "янь": "Чоловіче начало", "ярд": "Одиниця довжини в англійській системі мір", "яса": "Гучні звуки, гуркіт, грім"};
        case 4:
            return {"агат": "Твердий мінерал, напівдорогоцінний кварцовий камінь", "ажур": "Повний порядок", "алея": "Дорога, обсаджена з обох боків деревами, кущами", "альт": "Низький жіночий або дитячий голос", "анод": "Позитивно заряджений електрод", "аніс": "Однорічна рослина з родини зонтичних, своїм виглядом схожа на кріп", "арка": "Декоративна споруда у вигляді брами, що завершується склепінням", "арфа": "Щипковий музичний інструмент, що має форму трикутної рами з натягнутими на ній струнами", "атом": "Найдрібніша частинка хімічного елемента, що складається з ядра й електронів", "байт": "Послідовність із восьми біт, що опрацьовується разом комп'ютером", "бант": "Вузол з вільними петлями й кінцями", "бард": "Співець-поет у стародавніх кельтів", "бинт": "Стрічка з марлі або з іншої тканини для перев'язування ран", "бора": "Дуже сильний холодний вітер, що дме в приморських місцевостях з гір", "брат": "Кожний із синів стосовно до інших дітей того ж батька або матері", "бруд": "Те, що робить що-небудь нечистим ", "бура": "Хімічна натрієва сіль борної кислоти", "бурт": "Велика купа", "буча": "Великий крик, галас, тривога", "бюро": "Назва керівного органу партії, організації, установи", "біль": "Відчуття фізичного страждання", "в'яз": "листяне дерево із нерівнобокими листками та міцною деревиною", "вада": "Негативна риса, особливість кого-небудь, чого-небудь", "ваза": "Різноманітної форми посудина, що використовується для квітів, фруктів, солодощів або як декоративна річ", "вата": "Пухната маса з бавовни, шерсті та інших волокнистих речовин", "вежа": "Вузька споруда, що заввишки значно більша, ніж завширшки", "вето": "Заборона, яку один орган державної влади накладає на рішення іншого органу", "вино": "Алкогольний напій з виноградного або з деяких інших ягідних та плодових соків, що перебродили", "вухо": "Орган слуху й рівноваги в людини та хребетних тварин", "гара": "Довга вузька заглибина, гніздо в якій-небудь деталі, куди вставляється виступ іншої деталі; паз", "гора": "Значне підвищення над навколишньою місцевістю або серед інших підвищень", "горн": "Сигнальний ріжок", "грак": "Перелітний хижий птах родини воронових із блискучим чорним пір'ям", "гриб": "Нижчий безхлорофільний організм, що має форму шапки, надітої на ніжку, і розмножується головним чином спорами", "губа": "Кожна з двох шкірно-м'язових рухомих складок, що утворюють краї рота у людей і тварин", "двір": "Господарська ділянка, на якій розміщено садибні будівлі, а також місце біля них", "день": "Частина доби від сходу до заходу сонця, від ранку до вечора", "дрік": "Чагарникова або напівчагарникова степова рослина родини бобових, що цвіте жовтими чи білуватими квітами", "етюд": "Невеликий музичний твір віртуозного характеру, який використовують для вдосконалення музичних навичок", "ефір": "Трансляція телевізійного або радіосигналу в режимі реального часу", "єлей": "Рослинна, переважно маслинова олія, що використовується для церковних обрядів", "жезл": "Особливої форми паличка, що служить символом влади, високого становища", "жень": "Канат, сплетений з телячої шкіри чи конопляного валу", "зима": "Одна з чотирьох пір року між осінню і весною", "злак": "Різна, переважно корисна рослинність; трава", "зсув": "Ковзкі зміщення маси гірських порід вниз по схилу, які виникають через порушення рівноваги", "ідея": "Поняття, уявлення, що відбивають дійсність у свідомості людини та виражають ставлення її до навколишнього світу", "ім'я": "Особиста назва людини, що дається їй після народження", "їжак": "Ссавець родини їжакових", "йота": "Дуже маленька частина чого-небудь", "кава": "Тонізувальний напій, який отримують із зерен кави", "каре": "Бойове шикування піхоти у вигляді чотирикутника для відбивання атак ворога", "клуб": "Громадська організація, що об'єднує людей певного кола, професії для спільного відпочинку, розваг чи занять спортом", "кляп": "Шматок ганчірки тощо, який запихають у рот людині, щоб не могла кричати", "кіот": "Дерев’яна скриня, божниця, прикрашена шафка або засклена скриня для ікон", "лист": "Орган повітряного живлення і газообміну рослин у вигляді тонкої, звичайно зеленої пластинки", "лінт": "Короткі волокна бавовнику", "м'ята": "Багаторічна трав'яниста запашна рослина родини губоцвітих із довгасто-еліптичними листками та дрібними квітками, зібраними в густі пазушні кільця", "мить": "Дуже короткий відтинок часу", "мрія": "Те, що створене уявою, фантазією, витвір уяви", "нава": "Поздовжня частина християнського храму, розчленованого колонадами, стовпами або арками на головну і бічні", "нард": "Багаторічна трав'яниста рослина родини Валеріанових з м'ясистим запашним кореневищем і червоними квітками", "небо": "Видимий над поверхнею землі повітряний простір у формі купола", "нора": "Заглиблення в землі, вирите тваринами як житло", "нуль": "Цифра, що означає відсутність величини, а при підставлянні її до іншого числа справа означає збільшення його в десять разів", "окіт": "Пологи в овець, кіз, котячих та деяких інших ссавців", "омар": "Великий морський рак ряду десятиногих, що водиться в Атлантичному океані й ціниться за смачне м'ясо", "офіс": "Нежитлове, спеціально обладнане приміщення, у якому знаходиться представництво офіційної особи, установи, громадської організації або суб'єкта господарювання", "пиво": "Алкогольний напій середньої міцності, котрий виготовляють ферментацією ячмінного, або кукурудзяного, або рисового солоду", "пянь": "Рахункове слово для листів, аркушів паперу, глав, статей", "рада": "Спільне обговорення яких-небудь питань із кимось", "рінь": "Грубий пісок, гравій, галька", "сабо": "сучасна модель жіночого взуття із закритим носком, без п'ятки, на товстій підошві з дерева або спеціального пластику під дерево", "сало": "Жирове відкладення у тілі живого організму", "твір": "Самостійна шкільна або домашня робота у вигляді письмового викладу учнями своїх думок на задану тему", "туба": "Мідний духовий музичний інструмент", "убір": "Те, що одягають на себе", "уряд": "Найвищий виконавчий та розпорядчий орган державної влади, який здійснює управління державою", "фата": "Легке, звичайно довге, покривало з тюлю або мережива як весільний головний убір нареченої", "фейк": "Неправдоподібне, викривлене, скособочене подання інформації", "хата": "Сільський одноповерховий житловий будинок", "хмиз": "Невеликі тонкі гілки, відділені від дерева", "цап": "Самець кози", "цата": "Давньоруська прикраса ікони, що мала вигляд дуги і кріпилася біля шиї зображеної фігури", "цирк": "Вид театрального мистецтва, який включає акробатику, еквілібристику, жонглювання, клоунаду, дресирування тварин", "цмок": "Звуконаслідування, що означає уривчастий звук від хлюпання", "ціха": "Характерна риса, ознака ", "чача": "Грузинський міцний спиртний напій з класу виноградних бренді", "шлик": "Головний убір конічної форми, з хутряною оздобою", "юань": "Грошова одиниця Китаю і відповідна їй монета", "юпка": "Верхній жіночий одяг у вигляді довгої корсетки", "юрта": "Переносне житло з жердин, укрите шкурами чи повстю, в деяких кочових і напівосілих народів Центральної й Середньої Азії та Південного Сибіру", "юшка": "Суп м'ясний, картопляний, рибний", "язик": "Анатомічний рухливий м'язовий орган у ротовій порожнині хребетних тварин і людини, який допомагає захоплювати, пережовувати й ковтати їжу, визначає її смакові якості", "якір": "Пристрій для утримання на місці суден, плавучих маяків у вигляді металевого стержня з лапами, які чіпляються за ґрунт", "ярич": "Діалектна назва їжака", "ярус": "Один із горизонтальних рядів чого-небудь, розміщених один над одним або один під одним", "яхта": "Спортивне або туристське моторне, вітрильне чи вітрильно-моторне судно", "ящик": "Виріб із дощок чи фанери для зберігання предметів", "ящір": "Ссавець із подовженим тілом, вкритим зроговілими пластинками, довгим хвостом, невеликою головою, короткими лапами й міцними кігтями"};
        case 5:
            return {"абзац": "Відступ управо в початковому рядку якої-небудь частини тексту", "адрес": "Письмове, переважно ювілейне, звернення до особи, установи", "ажгон": "Однорічна рослина родини Зонтичних, яку вирощують у країнах Африки і Сходу як ефіроолійну культуру", "азарт": "Сильне захоплення чим-небудь", "бабак": "Великий гризун, товстий і незграбний, що живе в степу в норах", "багно": "Розріджена внаслідок дощів, розтавання снігу та земля на шляхах, стежках", "банан": "Пальмоподібна тропічна рослина з величезним листям і великим суцвіттям", "барон": "Дворянський титул, нижчий за графський", "вагон": "Спеціально устатковане приміщення для перевезення людей і вантажу рейковими коліями", "вапно": "Мінеральна речовина білого кольору, яку одержують випалюванням карбонатних порід", "васал": "Феодал, який одержував від заможнішого феодала-сюзерена земельні ділянки й заступництво, за що виконував для нього ряд повинностей", "вдова": "Жінка, яка після смерті чоловіка не одружилася вдруге", "весло": "Інструмент для руху човна водою", "ганок": "Прибудова з площадкою і східцями, а подекуди з покрівлею біля входу в будинок", "гараж": "Приміщення для стоянки та технічного обслуговування машин", "глава": "Розділ книжки, статті, що позначено нумерацією чи окремим заголовком", "глина": "Пластична осадова гірська порода", "джура": "Зброєносець у козацької старшини", "дзвін": "Ударний сигнальний підвісний інструмент, звичайно із сталі або бронзи, у вигляді порожнистої, зрізаної знизу груші, в середині якої підвішений ударник", "думка": "Дія розуму, кінцевий або проміжний продукт мислення", "ейчар": "Фахівець із роботи з персоналом", "єдваб": "Сорт коштовної шовкової тканини", "життя": "Стан живого організму в стадії розвитку, зросту", "жорно": "Кам’яні круги для помелу зерно з метою отримання борошна", "жулан": "Птах родини Сорокопудові ряду Горобцеподібні", "жінка": "Особа жіночої статі", "з'їзд": "Збори представників яких-небудь організацій, груп населення, діячів у певній галузі, які обмірковують і вирішують суспільно-політичні, наукові та інші питання", "заряд": "Певна кількість вибухової речовини, необхідна для пострілу, вибуху, яка міститься в патроні, снаряді, міні", "зброя": "Знаряддя для нападу чи оборони", "зріст": "Довжина тіла людини", "зірка": "Самосвітне небесне тіло, що являє собою скупчення розжарених газів", "іврит": "Єврейська мова з групи семітських, державна мова в Ізраїлі", "іспит": "Перевірка знань з якого-небудь навчального предмета", "кабак": "Родова назва рослин з родини гарбузових", "казка": "Розповідний твір про вигаданих осіб і події, переважно за участю фантастичних сил", "какао": "Тропічне вічнозелене дерево, з насіння якого виготовляють шоколад", "камса": "Дрібна морська промислова риба родини Анчоусових ряду Оселедцеподібних", "козел": "Дика жуйна тварина родини порожнисторогих, що живе в горах", "комар": " Комаха ряду двокрилі, має одну пару крил, струнке тіло, і довгі ноги", "лимон": "Південне вічнозелене цитрусове дерево, яке дає їстівні плоди", "лобур": "Бездіяльна й ледача людина", "любов": "Підвищений внутрішній потяг до чого-небудь, сильне бажання зайнятися чимось", "лігра": "Гібрид великих кішок: самця лева і самиці тигра", "ліска": "Деревина, яка залишається після зрізу дерева", "ліцей": "Навчальний заклад середньої базової освіти", "м'ясо": "Туша, частина туші забитих тварин, а також їжа, приготовлена з цих частин", "маска": "Пов'язка зі щілинами для очей, що закриває верхню частину обличчя", "мичка": "Пучок конопель або льону, підготовлений для прядіння", "муляр": "Будівельник, який виконує роботи з мурування або ремонту конструкцій зі штучних і природних будівельних матеріалів", "намет": "Літнє, переважно, спорудження із тканини, шкіри, рідше з гілля для відпочинку, захисту від непогоди — дощу, вітру та від сильної спеки ", "намір": "Задум, бажання зробити що-небудь", "наука": "Система знань про закономірності розвитку природи і суспільства та способи впливу на навколишній світ", "нежар": "Торішня трава, не з’їдена худобою", "об'єм": "Величина чого-небудь, вимірювана в кубічних одиницях", "обніж": "Квітковий пилок, що його бджоли на задніх ніжках переносять у вулик для виготовлення перги", "обрій": "Лінія позірного зіткнення неба з землею чи водною поверхнею; горизонт, небокрай", "ожика": "Багаторічна трав'яниста рослина родини ситникових з лінійними листками і волотевими або зонтикоподібними суцвіттями", "озеро": "Природна заглибина, заповнена водою", "океан": "Велике водне просторове утворення", "окріп": "Кипляча або дуже гаряча вода", "осінь": "Одна з чотирьох пір року", "папір": "Матеріал для писання, друку, малювання, виготовлений з ганчіркової, деревної та іншої маси", "парус": "Тканина для зміни напрямку вітру", "патіо": "Внутрішній дворик для відпочинку у південно-європейських містах", "писок": "Те ж саме, що і обличчя", "пісок": "Сипка гірська порода, що складається з крупинок твердих мінералів, переважно кварцу", "рисак": "Легкий рисистий кінь", "рілля": "Виоране поле", "сирть": "Промислова риба родини Коропових, що водиться в басейнах Північного і Балтійського морів", "смуга": "Видовжена, обмежена чим-небудь частина якоїсь поверхні, простору, що вирізняється на загальному тлі своїм виглядом, кольором", "сукня": "Жіночий одяг, верхня частина якого, що відповідає кофті, становить єдине ціле з нижньою частиною, що відповідає спідниці", "текст": "Відтворена письмово або в друкованому вигляді авторська праця, документ чи пам'ятка", "товар": "Будь-яка продукція, послуги, роботи, права інтелектуальної власності та інші немайнові права, призначені для продажу", "туман": "Густі дрібненькі краплинки роси, що роблять невидимим довкілля", "тютюн": "Трав'яниста рослина родини пасльонових, у листі якої міститься нікотин", "тяжба": "Цивільна судова справа, позов", "тяска": "Гвинтовий прес для видушування вина", "тітка": "Жінка по відношенню до дітей брата або сестри, а також до дітей брата або сестри свого чоловіка, сестра батька або матері, або дружина дядька", "убрус": "Старовинний жіночий головний убір", "уелсі": "Сорт яблуні американського походження", "учень": "Той, хто вчиться в загальноосвітній або спеціалізованій школі, що дає початкову й середню освіту", "фагот": "Дерев’яний духовий музичний інструмент", "фальш": "Підробка, обман, шахрайство", "форма": "Обриси, контури, зовнішні межі предмета, що визначають його зовнішній вигляд", "хвіст": "Придаток на задній частині тіла тварини, що являє собою продовження хребта від крижової кістки", "хмара": "Велика маса водяної пари в атмосфері", "хокей": "Спільна назва для командних спортивних ігор із ключкою, мета яких закинути м'яч або шайбу в ворота протилежної команди", "хінді": "Державна мова Індії, створена на основі гіндустані та санскриту", "цапок": "Козеня-самець", "цапфа": "Частина вала або осі, яка спирається на підшипник", "царга": "Рама, що з'єднує ніжки стола або крісла", "цвіль": "Елементи загнивання, розкладу в ідеології, психіці", "цибук": "Стебло цибулі, висадженої на насіння", "цибух": "Не заповнена тютюном частина цигарки", "цурка": "Короткий обрубок дерева; цурпалок", "черга": "Певна послідовність, порядок у діях, русі, прямуванні, слідуванні кого-, чого-небудь", "чубар": "Той, хто має чуб, чубчик", "шабаш": "Суботнє свято, відпочинок, передбачений юдаїзмом", "юрист": "Фахівець із правознавства, юридичних наук", "ялина": "Високе хвойне вічнозелене дерево родини соснових"};
        case 6:
            return {"абаван": "Дашок над дверима, над вікном для захисту від дощу і снігу", "абсент": "Міцний алкогольний напій зеленого кольору, що містить полинову, анісову та інші ароматичні олії", "азбука": "Сукупність літер якого-небудь письма, розміщених у встановленому порядку", "акація": "Назва кількох видів посухостійких дерев або кущів з білими чи жовтими квітками", "апатія": "Стан байдужості, млявості", "бабуся": "Пестлива форма до слова баба", "багнет": "Колюча зброя, яку звичайно насаджують на кінець дула рушниці", "базіка": "Той, хто любить багато говорити", "бандит": "Злочинець, який вдається до фізичного насильства під час вчинення злочинів", "батько": "Чоловік стосовно до своїх дітей", "беркут": "Великий хижий птах з породи орлів, який має темно-буре оперення", "бивень": "Дуже розвинені різці в сучасних та вимерлих хоботних", "бізнес": "Комерційна, біржова або підприємницька діяльність", "валюта": "Грошова одиниця, прийнята за основу грошової системи певної країни", "ватага": "Велика група людей; юрба, товариство", "ватник": "Півпальто або куртка, стьобані на ваті", "ваучер": "Цінний папір, що засвідчує право його власника на частку в державному майні", "вівчар": "Той, хто доглядає овець", "глитай": "Багатий власник, який визискує батраків і бідняків", "година": "Одиниця часу, містить 60 хвилин, 24 години утворюють добу", "голова": "Частина тіла, вище шиї", "гітара": "Струнний щипковий музичний інструмент сімейства лютень", "двигун": "Енергосилова машина, що перетворює яку-небудь енергію в механічну роботу", "двоїна": "Граматична категорія числа, вживана для позначення двох осіб або парних предметів", "джинса": "Замовний, проплачений матеріал у медіа, що видається за журналістсько-авторський", "дозвіл": "Згода, що дає право робити щось", "доктор": "Вищий науковий ступінь, який присуджується на підставі захисту дисертації, а також особа, якій присуджено цей ступінь", "дорога": "Смуга землі, по якій їздять і ходять", "економ": "Завідувач поміщицького господарства, економії", "екопак": "Вид пакування: те ж саме, що екологічне пакування", "епітет": "Художнє означення, за допомогою якого підкреслено якусь суттєву ознаку явища, предмета, події", "жандар": "Особа, яка служить у військах жандармерії", "живець": "Принада у вигляді дрібної живої рибки, яку використовують для ловлі хижих риб", "жолудь": "Плід дуба", "журнал": "Друковане періодичне видання", "заворг": "Скорочення від завідувач організацією", "залізо": "Хімічний елемент, блискучий, сріблястий, пластичний метал", "заявка": "Офіційне подання, що містить вимогу на що-небудь", "знання": "Наявність відомостей та інформації про кого-небудь або що-небудь", "золото": "Хімічний елемент, благородний метал жовтого кольору, гнучкий, тягучий і ковкий", "зяблик": "Співочий птах родини в'юркових", "ирджок": "Те ж саме, що землерийка", "імпорт": "Ввезення в країну товарів з-за кордону", "істина": "Моральний ідеал, справедливість", "істота": "Живий предмет, живий організм", "їздець": "Той, хто їде верхи: верхівець, вершник", "йойлик": "Людина, яка часто плаче, схильна до плачу, сліз", "кабака": "Нюхальний тютюн", "кабіна": "Невеличке окреме закрите приміщення, будка чи кімнатка спеціального призначення", "казино": "Гральний будинок з рестораном", "казкар": "Той, хто створює або розповідає казки", "кайман": "Один із видів крокодилів Центральної та Південної Америки, що має міцний панцир на спині й череві", "какаду": "Тропічний дикий птах родини папуг, що найчастіше має білий або рожевий колір, із чубком на голові", "кактус": "Південна рослина, що має товсте стебло (без листя), покрите колючками або лускою", "калька": "Прозорий папір або тонка тканина, що накладається на креслення чи малюнок для точного копіювання", "камінь": " Тверда гірська порода чи мінерал у вигляді суцільної маси або окремих шматків", "лагуна": "Неглибока морська затока, що утворилась внаслідок відокремлення частини моря піщаною косою", "лампас": "Кольорова смужка зі сукна, яку нашивають по зовнішньому шву формених штанів", "легеня": "Орган дихання у людини і хребетних тварин, що розміщується в грудній порожнині", "лижник": "Той, хто ходить на лижах або займається лижним спортом", "лизень": "Язик великої рогатої худоби", "лобода": "Найпоширеніший бур'ян, що засмічує посівні та городні культури", "лобіст": "Особа, що знаходиться на службі якої-небудь великої монополії, за допомогою якої здійснюється тиск на законодавців і чиновників в інтересах цієї компанії", "людина": "Істота, що належить до роду Homo", "м'якуш": "підшкірна частина плодів і ягід", "майдан": "Велике незабудоване місце в місті або селі, площа", "могила": "Місце поховання людини або тварини", "момент": "Короткий відтинок часу, коли виконується, відбувається якась дія", "навахо": "Індіанський народ, проживаючий на південному заході США", "ненька": "Ласкаве звертання до жінки, переважно старої", "ножиці": "Інструмент для різання, стриження, що складається з двох навхрест з'єднаних ножів з ручками у вигляді кілець", "ніздря": "Один із двох зовнішніх отворів у носі", "обапіл": "Розпиляна вздовж колода, розпиляний стовбур дерева", "огірок": "Овочева городня рослина родини гарбузових зі сланким стеблом і невеликими довгастими плодами", "округа": "Навколишня місцевість", "орбіта": "Шлях руху небесного тіла", "палата": "Кімната для хворих у лікувальному закладі", "пальто": "Верхній одяг довгого крою, що надягається поверх сукні, костюма", "пардус": "Різновид леопарда, що зустрічається в пустелях Туркменії", "прапор": "Полотнище певного кольору чи поєднання кольорів, часто з певним зображенням, прикріплене до держална чи шнура", "піонер": "Людина, яка вперше проникає в недосліджений край і освоює його", "рейвер": "Музикант, диск-жокей у напрямку рейву", "рушник": "Довгастий шматок тканини для витирання обличчя, тіла, посуду", "різьба": "Мистецтво вирізування малюнка, візерунка на якому-небудь твердому матеріалі", "салямі": "Сорт твердої сирокопченої ковбаси", "сервіс": "Обслуговування населення, забезпечення його побутових потреб", "такмед": "Скорочення від тактична медицина", "твердь": "Повітряний простір у формі купола, видимий над поверхнею землі", "убоїще": "Неслухняна, уперта, задирлива, а також ледача, недбала людина", "фліска": "Флісова куртка", "харпак": "Бідняк, злидар", "худоба": "Чотиринога свійська сільськогосподарська тварина", "царина": "Околиця, край села", "цемент": "Мінеральна порошкоподібна речовина, з якої при замішуванні з водою утворюється однорідна в'яжуча маса", "цитрон": "Вічнозелена субтропічна цитрусова рослина родини рутових з великими жовтого або жовтогарячого кольору плодами, схожими на лимони", "шавнер": "Працівник залізничного транспорту, який супроводжує поїзд і стежить за безпекою його руху, за збереженням вантажу", "шелест": "Тихий, глухий звук, шум від тертя одного предмета об другий", "щавель": "Трав'яниста, переважно багаторічна, рослина родини гречкових, стебло й продовгувате листя якої здебільшого має кислий смак", "яблуко": "Плід яблуні", "ячмінь": "Злакова рослина, зерна якої використовують для виготовлення круп, борошна, на корм худобі, а також як сировину для пивоварної промисловості"};
        case 7:
            return { "абордаж": "Зчеплення двох суден бортами", "автомат": "Апарат, машина, прилад що виконує роботу за допомогою особливого механізму без участі людини", "акробат": "Вправний гімнаст виконавець складних гімнастичних номерів у цирку", "бавовна": "Нитки з бавовника", "базальт": "Вулканічна гірська порода щільної або дрібнозернистої будови", "балахон": "Просторий і довгий одяг що надягається поверх усього для захисту від пилу", "бердник": "Майстер, який робить берда", "вапнець": "Хімічний елемент і метал кальцію", "ведмідь": "Великий хижий ссавець з незграбним масивним тілом, укритий густою шерстю", "волосся": "Сукупність волосин що є природним покривом шкіри тварин", "вчитель": "Людина яка навчає інших людей своїх учнів передає їм певні знання про життя", "галушка": "Українська народна страва, різаний або рваний шматочок прісного тіста, зварений на воді або на молоці", "грудень": "Дванадцятий місяць року в григоріанському календарі", "густина": "Фізична маса тіла що міститься в одиниці його об'єму в 1 м³ в 1 см³, характеризує кожну речовину", "динаміт": "Бризантні вибухові суміші на основі нітрогліцерину з поглиначем та іншими домішками", "дифузія": "Рух часток середовища, внаслідок якого відбувається перенесення речовини і вирівнювання концентрацій або встановлення рівного розподілу концентрацій частинок даного виду в середовищі", "добуток": "Результат операції множення", "діалект": "Місцевий різновид мови", "еритрон": "сукупність нерухомих і циркулюючих клітин еритроцитарного ряду, які розташовані інтраекстравазально і перебувають на всіх стадіях розвитку", "єдність": "Тісний зв'язок, згуртованість, цілісність, неподільність", "женитво": "Час весілля", "журфікс": "Приймання гостей у завчасно визначені дні тижня", "заколот": "Збройний виступ ворожих сил проти державної влади, організований у результаті таємної змови", "звіздар": "Той, хто займається ворожінням на планетах і зірках", "ікебана": "Мистецтво складання букетів із живих або засушених рослин, що культивується в Японії", "іпотека": "Застава землі нерухомого майна при якій земля та або майно що становить предмет застави залишається у заставодавця або третьої особи", "історія": "Закономірний послідовний розвиток дійсності зміни в дійсності у процесі життя", "їдальня": "Кімната в хаті з обіднім столом у якій їдять і п'ють", "їжачник": "Рід багаторічних трав'янистих рослин чи напівкущів родини лободових", "йордань": "Прорубна водосвятна хрещенська ополонка", "казанок": "Невелика металева посудина з дужкою та глибокою накривкою у якій варять страву в польових умовах або з якої їдять", "каземат": "Оборонна споруда, збудована на поверхні землі або під землею для захисту від снарядів та авіабомб дрібного й середнього калібру", "каталог": "Список, перелік книжок, рукописів, картин і складений у певному порядку щоб полегшити їх розшук", "квітень": "Четвертий місяць року в григоріанському календарі", "компрес": "Пов'язка, яку накладають на хворе місце для лікування", "лимонка": "Ручна граната Ф-1, що формою нагадує лимон", "логотип": "Комбінація початкових букв, що являє собою скорочену назву якої-небудь установи, підприємства, фірми", "магістр": "Академічний ступінь, кваліфікація, що здобувається студентом після закінчення магістратури", "новація": "Припинення зобов'язання за згодою сторін через заміну його новим", "ожеледь": "Тонкий шар льоду на поверхні землі чи деревах", "патруль": "Невеликий рухомий озброєний загін або військове судно, літак для догляду за порядком, безпекою на якому-небудь об'єкті, в якомусь районі", "райрада": "Скорочення від районна рада", "санітар": "Молодший медичний працівник у лікувальному закладі, зайнятий доглядом за хворими та пораненими, підтримкою чистоти у приміщеннях та виконанням допоміжних функцій в медичній практиці", "скрипка": "Смичковий чотирьох струнний музичний інструмент, найвищий за регістром", "скіпетр": "Символ царської влади — жезл, прикрашений коштовним камінням, різьбою, карбуванням", "словник": "Книга, в якій в алфавітному чи тематичному порядку подано слова якоїсь мови", "смерека": "Багаторічне вічнозелене хвойне дерево з конусоподібною кроною", "сметана": "Верхній жирний шар кислого незбираного молока", "совість": "Усвідомлення і почуття моральної відповідальності за свою поведінку, свої вчинки перед самим собою, людьми, суспільством", "сопілка": "Народний духовий музичний інструмент із дерева або очерету, що має форму порожнистої трубки з отворами", "сталкер": "Нелагальний турист-екстремал", "столиця": "Головне місто, адміністративно-політичний центр держави, республіки", "сторона": "Простір, місцевість, розташовані в якому-небудь напрямку від когось, чогось, а також цей напрямок", "студент": "Той, хто навчається у вищому або середньому спеціальному навчальному закладі", "стілець": "Предмет меблів, призначений для сидіння, що має спинку", "тактика": "Складова частина військового мистецтва, що включає теорію й практику підготовки, організації та ведення бою", "тангенс": "Тригонометрична функція, позначається tg", "тварина": "Будь-яка істота на відміну від рослини чи людини", "творець": "Той, хто створює матеріальні або духовні цінності", "телефон": "Вид електрозв'язку, пристрій для передачі звуку на великі відстані за допомогою електричних сигналів", "тиждень": "Одиниця виміру часу від понеділка до неділі включно", "тканина": "Сукупність клітин, не обов'язково ідентичних, але спільного походження, що разом виконують спільну функцію", "травень": "П'ятий місяць року в григоріанському календарі", "трамвай": "Міський рейковий електричний вид транспорту", "транзит": "Перевезення вантажів або пасажирів з однієї держави до іншої або з одного населеного пункту до іншого через проміжні пункти", "тромбон": "Мідний духовий музичний інструмент", "троянда": "Рід і культурна форма рослин родини трояндових", "убрання": "Сукупність предметів, виробів із тканини, хутра, шкіри, якими одягають, закривають тіло", "укулеле": "Струнний щипковий музичний інструмент, маленька чотириструнна гітара", "усмішка": "Особливий порух м'язами обличчя (губ, очей), який виражає схильність до сміху", "утопізм": "Термін, що вживається для означення ідеального або неможливого суспільства", "учасник": "Той, хто бере чи брав участь у чому-небудь", "фабрика": "Форма організації виробництва – невелике промислове підприємство, основою якого є машинна техніка", "флешбек": "Ретроспективний епізод", "фортеця": "Укріплений пункт з міцними капітальними спорудами, постійним гарнізоном, озброєнням та різними запасами", "фініфть": "Емаль, якою покривають візерунки на металевих виробах та фарфорі", "харизма": "Виняткова обдарованість", "хвальба": "Добрий, похвальний відгук про когось, щось", "хвилина": "Одиниця виміру часу, що дорівнює 1/60 години, або 60 секундам", "хвороба": "Порушення нормальної життєдіяльності організму під впливом несприятливих чинників внутрішнього й зовнішнього середовища", "хвіртка": "Невеликі вхідні двері в тину або в воротах", "хлопець": "Хлопчик, підліток", "хлібець": "Спресований продукт із зерна", "холонім": "Поняття, що відноситься до іншого поняття як ціле до своєї складової частини", "хрускіт": "Звук, що виникає при дробленні чогось сухого, ламкого", "царевич": "Син царя", "царство": "Держава, якою править цар", "цвинтар": "Місце, відведене для поховання померлих", "цвіркун": "Комаха підряду Прямокрилих, яка тертям крил створює тріскучі звуки", "цвіркіт": "Цвірінькання", "цензура": "Система державного нагляду за друком та засобами масової інформації", "цикорій": "Трав'яниста рослина родини складноцвітих", "циліндр": "Геометричне тіло, що утворюється обертанням прямокутника навколо одного з його боків", "червень": "Шостий місяць року в григоріанському календарі", "чоловік": "Особа чоловічої статі", "шинквас": "Прилавок", "штабель": "Рівно укладений ряд чого-небудь", "юстиція": "Суд, судова діяльність держави", "ясність": "Властивість за значенням ясний", "ячмінка": "Ячмінна солома"};
        case 8:
            return { "абориген": "Корінний житель країни або місцевості", "абстракт": "Поняття, створене шляхом абстрагування", "авангард": "Передова, провідна частина певної суспільної групи або класу", "аванпост": "Передовий пост, виставлений в стороні очікуваного нападу ворога, з ціллю попередження нападу зненацька", "авантюра": "Ризикований захід", "автобаза": "Транспортне підприємство для організації перевезень на автомобілях", "автограф": "Власноручний підпис, напис на книзі, фотографії", "автостоп": "Пристрій для автоматичної зупинки поїзда при наближенні його до закритого колійного сигналу", "аерозоль": "Безліч найдрібніших частинок якої-небудь речовини, розпилених у газі або газоподібному середовищі", "аеропорт": "Авіатранспортне підприємство, до якого належить аеродром, аеровокзал, ангари, системи керування повітряним рухом, радіонавігації і посадки літальних апаратів", "аеростат": "Літальний апарат, наповнений газом, легшим від повітря", "академік": "Член академії наук", "академія": "Назва найвищих державних наукових установ, завданням яких є розвиток наук або мистецтв", "акордеон": "Музикальна хроматична гармонія з клавіатурою для правої руки", "алгоритм": "Система правил виконання обчислювального процесу, що приводить до розв'язання певного класу задач після скінченного числа операцій", "алкоголь": "речовина етиловий спирт, котра застосовується для отримання спиртних напоїв", "альбінос": "Уроджена відсутність пігменту шкіри волосяного покриву пір'я райдужки ока у тварин", "алігатор": "Тупорилий крокодил, що водиться в Америці і Південному Китаї", "анатомія": "Наука про будову функції і розвиток живого організму", "багряний": "Густо-червоний, пурпуровий", "баклажан": "Однорічна городня рослина з довгастими синіми чи фіалковими плодами", "бактерія": "Мікроскопічний одноклітинний організм", "балдахін": "Накриття, переважно з дорогої тканини з оздобами, над троном, ліжком, носилками чи катафалком", "барометр": "Прилад для вимірювання атмосферного тиску", "біженець": "Людина, що залишає місце свого проживання під час війни або стихійного лиха", "біологія": "Наука про закономірності життя і розвитку організмів", "важковоз": "Робочий кінь, що використовується для перевезення важких вантажів, а також для інших робіт, що вимагають великої фізичної сили", "валгалла": "У давньоскандинавській міфології палац бога Одіна, рай для загиблих лицарів, де вони проводять час у безперервних розвагах", "вересень": "Дев'ятий місяць року в григоріанському календарі", "враження": "Те, що залишається у свідомості людини від баченого, пережитого", "гангстер": "Член бандитської організації, що робить бізнес незаконними засобами — вбивством, грабунком, підкупом чи шантажем", "гарантія": "Порука в чомусь, забезпечення чого-небудь", "геодезія": "Наука про методи визначення форми і розмірів Землі або окремих її частин зображення земної поверхні на планах і картах і точних вимірювань на місцевості", "геологія": "Наука про Землю: її речовинний склад, будову та розвиток", "горобець": "Маленький сірий птах, який живе переважно поблизу житла людини", "господар": "Голова сім'ї, господарства", "гітарист": "Той хто грає на гітарі", "дайджест": "Короткий зміст інших публікацій", "даркстор": "Супермаркет закритого типу, до яких мають доступ лише кур’єри сервісів доставки", "дзеркало": "Відшліфована поверхня, що відображає предмети, які перед нею знаходяться, а також спеціально виготовлений предмет із такою поверхнею", "дизайнер": "фахівець із дизайну", "діапазон": "Межі поширення", "евфемізм": "Слово чи вираз, яким замінюють у мові грубе, непристойне, з неприємним емоціональним забарвленням слово", "екологія": "Наука, що вивчає закономірності формування і функціонування біологічних систем та їх взаємодію з навколишнім середовищем", "експонат": "Музейний предмет який виставлено для огляду, є структурною одиницею експозиції і складає основу музейної комунікації", "елеватор": "Зерносховище, обладнане пристосуваннями для підіймання, сушіння, зберігання великої кількості зерна", "ендорфін": "Представник групи хімічних сполук які природно виробляються в головному мозку і мають здатність зменшувати біль аналогічно опіатам і впливати на емоційний стан", "ендоскоп": "Прилад для освітлення та дослідження внутрішніх органів", "етологія": "Розділ зоології що вивчає поведінку тварин", "єдиноріг": "Фантастична тварина у вигляді коня з одним рогом", "жаберина": "Жаб'яча ікра", "жеребець": "Самець кобили", "зав'язка": "Початок, основа, вихідний пункт, момент чого-небудь", "завдання": "Наперед визначений, запланований для виконання обсяг роботи, справа", "загибель": "Втрата життя, смерть, звичайно передчасна", "землекоп": "Робітник, який виконує земляні роботи", "зерновоз": "Вагон для перевезення зерна", "значення": "Сутність чого-небудь", "ідеалізм": "Напрям у філософії, який, на противагу матеріалізмові, вважає ідею, дух, свідомість первісним, а природу, буття, матерію – вторинним", "імпостор": "Зрадник, засланий козачок", "імунітет": "Несприйнятливість організму до збудників заразних хвороб, до отруєння", "інтелект": "розум, здатність людини думати мислити", "інтернет": "Всесвітня система взаємосполучених комп’ютерних мереж", "ітерація": "Повторне застосування математичної операції при розв'язанні обчислювальних задач, яке дає можливість поступово наблизитися до правильного результату", "їздецтво": "Професія їздця", "кавасакі": "Дерев'яне моторно-вітрильне судно з малою осадкою", "каденція": "Тривалість повноважень виборного органу чи посадової особи", "картопля": "Вид рослин родини Пасльонових, поширена сільськогосподарська культура", "каструля": "Металевий посуд", "катарсис": "Випуск емоційної енергії, що допомагає зняти психологічну напругу", "керівник": "Той, хто керує ким-небудь, чим-небудь, очолює когось, щось", "клоунада": "Виступи клоунів у цирковій виставі", "кінцівка": "Графічна прикраса в кінці книжки чи розділу", "лаборант": "Працівник лабораторії", "листопад": "Одинадцятий місяць року в григоріанському календарі", "логометр": "Електровимірювальний механізм, робота якого основана на створенні електричного протидійного моменту", "лінгвіст": "Фахівець із лінгвістики", "манівець": "Обхідний шлях, обхід", "методика": "Сукупність взаємозв'язаних способів та прийомів доцільного проведення будь-якої роботи", "мудрість": "Глибоке знання, розуміння, узагальнення чогось", "музикант": "Той, хто грає на якомусь музичному інструменті", "містечко": "Різновид поселення в різних країнах світу що менше за місто але більше за село", "нестинар": "Танцівник на вугіллі", "новеліст": "Письменник, що пише новели", "овуляція": "Вихід дозрілої яйцеклітини з яєчника", "океанавт": "Дослідник океану, який провадить спостереження під водою", "офензива": "Військовий наступ", "паливода": "Відчайдушна людина, яка нікого й нічого не боїться і ні перед чим не зупиняється", "паралакс": "Видима зміна положення одних нерухомих об'єктів відносно інших, що розташовані на різній відстані один від одного при переміщенні спостерігача", "рейкобус": "Скорочення від рейковий автобус", "сагайдак": "Шкіряна сумка або дерев'яний футляр для стріл", "свавілля": "Самочинні дії й схильність до них при нехтуванні думки й волі інших", "тетраедр": "Правильний чотиригранник, кожна грань якого являє собою правильний трикутник", "узундара": "Народний жіночий сольний танець, який часто виконується на весіллях", "фахівець": "Той, хто досконало володіє якимсь фахом, має високу кваліфікацію глибокі знання з певної галузі, науки, техніки мистецтва", "фельдшер": "Особа, приналежна до середнього медичного персоналу, що є помічником лікаря або іноді надає медичну допомогу самостійно на так званих фельдшерських пунктах", "халабуда": "Рід намету, що має основу з жердя, критого соломою, корою чи шкірами", "цейхгауз": "Військовий склад зброї та обмундирування", "частокіл": "Огорожа, паркан з кілків, жердин, паль, вбитих у землю густо одне біля одного", "шимбалок": "Дошка з уступами, на яку кладуть полички"};
        case 9:
            return { "аб'юрбція": "Прилюдне зречення віри або своїх переконань", "авторитет": "Загальновизнане значення, вплив, поважність", "авіалінія": "Постійний шлях літаків між двома або кількома населеними пунктами", "алкоголік": "Той хто хворіє на алкоголізм", "альпініст": "Той хто займається альпінізмом", "аналітика": "Вчення про силогізми й доведення", "астронавт": "Фахівець з астронавтики", "аудиторія": "Зал для читання лекцій, доповідей", "багатство": "Велике майно, цінності, гроші", "баскетбол": "Спортивна гра в м'яч між двома командами, учасники якої повинні руками закидати м'яч у «кошик», що висить на стовпі", "безглуздя": "Нерозумна дія, вчинок", "біозахист": "Скорочене від біологічного захисту", "валькірія": "У давньоскандинавській міфології — войовничі вершниці, діви-богині, що носилися над полем бою, розподіляючи перемогу і смерть", "вандалізм": "Нещадне руйнування і нищення пам'яток мистецтва й культури", "велосипед": "Напівавтоматична дво- і триколісна машина, що рухається силою їздця, який натискує ногами на педалі", "випускник": "Той хто вчиться в останньому класі на останньому курс або закінчив навчальний заклад одержавши відповідне свідоцтво чи диплом", "водоканал": "Підприємство, що забезпечує послуги водопостачання та водовідведення", "газомотор": "Мотор, що приводиться в дію газом", "городянин": "Житель міста", "граматика": "Навчальний предмет цієї науки", "гіпербола": "Стилістичний засіб перебільшення певних ознак чи якостей предмета, явища або дії з метою посилення художньої виразності", "диктатура": "Нічим не обмежена влада особи, класу, групи, що спирається на силу та певну державну структуру", "дослідник": "Той, хто займається науковими дослідженнями, вивченням, обслідуванням чого-небудь", "драмтеатр": "Драматичний театр", "евакуація": "Процес виведення населення і життєважливих ресурсів першої необхідності з території можливої загрози від катастрофи чи воєнного конфлікту", "едельвейс": "Гірська трав'яна рослина, квітка якої схожа на білу зірку", "економіка": "Сукупність виробничих відносин даного суспільного ладу, відповідних до продуктивних сил суспільства", "євробляха": "Автомобіль на іноземній", "желехівка": "Український фонетичний правопис поширений на заході України з 1886 року й до 1922 року створений Євгеном Желехівським", "жовтобрюх": "Велика неотруйна із жовтуватим черевом змія родини вужевих", "журналіст": "Професіональний літературний працівник газет журналів, радіо та інших органів інформації", "з'єднання": "Те, що з'єднує що-небудь із чимось", "заголовок": "Назва будь-якого твору, його частини, розділу або статті, повідомлення, назва газети, журналу", "землетрус": "Коливання земної поверхні та підземні поштовхи, які виникають унаслідок геологічних процесів, що відбуваються в надрах Землі або в земній корі", "імпічмент": "Процедура залучення вищих посадових осіб до суду парламенту з метою позбавлення їх повноважень", "інкубатор": "Апарат для штучного виведення молодняку сільськогосподарських птахів з яєць", "інноватор": "Людина, яка постійно прагне привнести щось нове в сьогоднішній день, зробити вже набридлі речі оригінальними і цікавими", "кавалерія": "Кінне військо", "кавітація": "Утворення в краплинній рухомій рідині порожнин, заповнених газом, парою або їх сумішшю", "катавасія": "Розгардіяш, гармидер, метушня", "катаклізм": "Стихійне лихо", "катакомба": "Підземні природні або штучні печери з довгими заплутаними ходами", "катакомби": "Підземні погребальні галереї під церквою", "катамаран": "Пліт або невелике веслове чи парусне судно, що складається зі з'єднаних між собою колод", "категорія": "Основне логічне поняття, що відбиває найзагальніші закономірні зв'язки й відношення, які існують у реальній дійсності", "конвенція": "Угода, договір між державами з приводу якого-небудь питання", "континент": "Один з найбільших масивів суші Землі, більша частина поверхні яких виступає над рівнем моря", "контрабас": "Найбільший за розміром і найнижчий за звучанням смичковий музичний інструмент", "кореляція": "Співвідношення, відповідність, взаємозв'язок предметів або понять", "кінотеатр": "Приміщення для публічного показу кінофільмів", "ланчбокс": "Коробка для сніданку, обіду з собою чи на роботу", "лоботомія": "Розтин частки головного мозку", "логістика": "Контроль за рухом матеріалів на підприємстві: від надходження сировини до постачання готового товару споживачеві", "маретниця": "Атрибут святкування 1 березня, Дня зустрічі весни, зв’язаний з червоно-білої пряжі талісман", "маркетинг": "Діяльність, спрямована на створення попиту та досягнення цілей підприємства через максимальне задоволення потреб споживачів", "маршрутка": "Маршрутне таксі, маршрутний автобус", "мистецтво": "Творче відображення дійсності в художніх образах, творча художня діяльність", "міфологія": "Сукупність міфів якого-небудь народу", "навігатор": "Той, хто займається навігацією, штурман", "наявність": "Існування, присутність", "номінація": "Категорія осіб, творів, з-поміж яких журі обирає кращих", "облігація": "Цінний папір, який приносить процент", "обов'язок": "Сукупність моральних зобов'язань людини перед іншими", "ожеледиця": "Шар льоду на земній поверхні, що утворюється після дощу або відлиги при зниженні температури", "онтологія": "Шаблон наук філософії, вчення про буття, осягнення основ усього сущого розумом або інтуїцією", "паламарка": "Дружина паламаря", "поліграма": "Графіки, отримані з використанням поліграфа", "понеділок": "Перший день тижня", "пословиця": "Те ж саме, що і приказка", "прабабуся": "Мати діда або баби", "президент": "Обраний на певний строк глава держави", "призовник": "Особа, приписана до призовної дільниці", "прихисток": "Захист, притулок", "продавець": "Той, хто продає який-небудь товар", "підрозділ": "Складова частина чого-небудь більшого", "пісочниця": "Місце на дитячому майданчику для ігор з піском", "рабемаунт": "Класична схема мотоциклетної задньої підвіски з видимими боковими амортизаторами", "репертуар": "Сукупність творів, що виконуються в театрі, на концертній естраді", "рерайтинг": "Процес створення нового унікального тексту з наявного", "сатуратор": "Апарат для насичення рідин вуглекислим газом або повітрям", "свідчення": "Факт, річ, обставина що підтверджують що-небудь", "сніговиця": "Сніжна погода", "спільнота": "Об'єднання людей, згуртованих спільними умовами життя, метою, інтересами", "стипендія": "Регулярна грошова допомога, яку надають тим хто навчається в навчальних закладах а також особам, що перебувають в аспірантурі, докторантурі", "стратегія": "Мистецтво підготовки і ведення війни та великих воєнних операцій", "телекінез": "Здатність зусиллям думки впливати на предмети", "транспорт": "Той чи інший вид перевізних засобів", "увеопатія": "Невизначена назва уражень судинної оболонки незапального характеру", "упертість": "Надмірна і нерозсудлива наполегливість", "фазанарій": "Місце для утримання фазанів", "філологія": "Сукупність наук, що вивчають мову й літературу якогось народу; мова та література", "хазяйство": "Виробнича, передусім сільськогосподарська, одиниця із засобами виробництва", "хіротонія": "Християнський обряд, під час якого відбувається таїнство поставлення в священнослужителі", "цвинтарка": "Трав'яниста лікарська рослина родини тирличевих, із рожевими квітками і золотисто-жовтими пиляками", "цитологія": "Великий розділ біології що вивчає структурно-функціональну організацію", "чанашниця": "Посудина для приготування чи подання чанахів", "числівник": "Частина мови, яка позначає кількість предметів", "шабельник": "Той, хто виробляє шаблі", "шерхебель": "Рубанок для стругання деревини", "щадрівник": "Хлопець, який ходить щедрувати"};
        case 10:
            return { "абітурієнт": "Особа, яка вступає до вищого чи професійно-технічного навчального закладу", "автомийник": "Робітник, який працює на автомийці", "автомобіль": "Самохідна машина з двигуном внутрішнього згоряння для перевезення пасажирів і вантажів безрейковими дорогами", "автострада": "Широкий бетонований шлях (без поперечних переїздів) для масового автомобільного руху", "акумулятор": "Прилад для нагромадження електричної енергії з метою дальшого її використання", "антициклон": "Ділянка високого атмосферного тиску, від центру якої розходяться спадні потоки повітря", "асиміляція": "Процес засвоєння рослинним чи тваринним організмом зовнішніх щодо нього речовин", "безголів'я": "Нещастя, горе, біда", "братерство": "Велика дружба, братське єднання", "бібліотека": "Установа культосвітній заклад, де зберігаються і видаються читачам книжки, журнали", "бісектриса": "Пряма лінія, що проходить через вершину кута і поділяє його навпіл", "вагітність": "Стан жінки в період розвитку плоду в її організмі", "вакцинація": "Введення вакцини в організм людини чи тварини", "варварство": "Низький ступінь культурного розвитку, неуцтво, грубість, безжальне ставлення до культурних цінностей", "вентилятор": "Пристрій для вентиляції, зазвичай з лопатями, що обертаються, які додають повітрю рух", "відвідувач": "Той, хто відвідує кого-, що-небудь", "відеопотік": "Стрім, відеотрансляція, онлайн-трансляція", "відеоролик": "Короткий відеофільм інформаційного, рекламного, навчального або розважального змісту", "геральдист": "Історик — фахівець з геральдики", "гермомішок": "Мішок, що закривається герметично", "гетьманець": "Прихильник гетьмана, Гетьманату", "гончарство": "Різновид ремесла з обробки глиняних виробів", "громадянин": "Особа що належить до постійного населення якої-небудь держави, користується її правами і виконує обов'язки, встановлені законами цієї держави", "дахівкарня": "Фабрика з виготовлення дахівки", "делінеатор": "Пристрій-обмежувач у вигляді гумового стовпця, що відділяє проїжджу і непроїжджу частини вулиці", "демократія": "Форма управління, політичний лад за якого верховна влада належить народові", "дендропарк": "Ландшафтний парк з колекцією деревно-кущаних рослин, що ростуть в природних умовах", "діалектизм": "Слово або інший елемент у літературній мові, взятий з діалекту", "діяльність": "Праця, дії людей у якій-небудь галузі, застосування своєї праці до чого-небудь", "експертиза": "Розгляд, дослідження справи, певного питання для правильного висновку, правильної оцінки якогось явища", "екстремізм": "Прихильність до крайніх поглядів і заходів", "елітологія": "Вчення і вивчення еліт як предмет політологічного зацікавлення", "енергоміст": "Енергенетиний міст між країнами або містами", "жайворонок": "Невеликий горобцеподібний птах", "заможність": "Достаток, багатство", "захоплювач": "Той, хто захопив щось", "зубчатівка": "Петлиця вояка Української Галицької армії із характерними зубцями", "інвестиція": "Капітальні блага, які купують фірми і приватні особи для збільшення нагромадженого капіталу", "іннервація": "Вплив нервів на діяння тіла та його органів", "інсектицид": "Хімічні препарати для захисту рослин від шкідливих комах", "інтеракція": "Безпосередня міжособистісна взаємодія", "інфлюенсер": "Людина зі значним суспільним впливом здебільшого медійним", "їстівність": "Придатність до їжі", "йогуртниця": "Пристрій для приготування йогуртів", "кавалерист": "Той, хто служить у кавалерії", "каліграфія": "Уміння, майстерність писати чітким, рівним, гарним почерком", "капіталізм": "Суспільний лад, в основі якого лежать різні форми приватної власності на засоби виробництва, ринкова економіка і громадянське суспільство, яке складається з двох основних класів — власників засобів виробництва і найманих робітників", "каріологія": "Розділ цитології, що вивчає будову та функції клітинного ядра, закономірності поділу й еволюцію ядра та його структурних компонентів", "катапульта": "Старовинний військовий пристрій для кидання важкого каміння, загострених колод під час облоги фортець", "катастрофа": "Подія, яка призводить до смертей безпосередньо чи через наслідки у майбутньому", "коефіцієнт": "Числовий або літерний множник у функціональній залежності", "комісіонер": "Посередник в угодах", "кілометраж": "Протяжність у кілометрах", "кіносеріал": "Багатосерійний кінотвір, призначений для демонстрації в кінотеатрах", "лапароскоп": "Медичний ендоскоп, який вводиться через прокол у черевній стінці з метою дослідження черевної порожнини", "латифундія": "Велике земельне володіння, маєток", "легкоатлет": "Спортсмен, який займається легкою атлетикою", "література": "Сукупність наукових художніх творів того чи іншого народу, періоду або всього людства", "м'ясорубка": "Ручна машинка або спеціальна машина для розмелювання м'яса на фарш", "манікюрник": "Особа яка робить манікюр", "модулометр": "Прилад для вимірювання коефіцієнта амплітудної модуляції", "надвечір'я": "Час перед вечором", "наперсткар": "Організатор азартної гри, де кулька чи інша річ схована між трома наперстками чи схожим ковпачком, в якій належить вгадати розташування кульки", "настільник": "Настільний предмет: вишивка, килимок", "обструкція": "Дія, демонстративно спрямована на зрив якого-небудь заходу, пропозиції", "оголошення": "Повідомлення, оповіщення про що-небудь", "океанаріум": "Водоймище, басейн, обладнані для утримання морських тварин і риб з метою спостереження за ними та вивчення їх", "окружність": "Замкнена крива, всі точки якої рівновіддалені від центра", "органайзер": "Діловий щоденник, записник з можливістю планування", "орфографія": "Система загальноприйнятих правил написання слів якої-небудь мови", "панегірист": "Поет, що складає панегірики", "первозим'я": "Перші зимові дні, початок зими", "першоносій": "Той, хто першим почав мати ім'я, прізвище", "петиціонер": "Той, хто бере участь у поданні петиції", "письменник": "Людина що пише художні твори, особа для якої літературна діяльність є професією", "поліфоніст": "Композитор, автор поліфонічної музики", "провокація": "Навмисні дії проти окремих осіб, організацій, держав з метою штовхнути їх на згубні для них вчинки", "підсусідок": "Безземельний селянин, що проживав у чужому будинку", "радикалізм": "Світогляд і політика радикалів", "реанімація": "Лікувальні заходи, які спрямовані на оживлення організму під час клінічної смерті, відновлення його життєво важливих функцій", "республіка": "Одна з форм державного правління за якої верховні органи державної влади обираються на певний строк у тому чи іншому порядку", "свідомість": "Процес відображення дійсності мозком людини, який охоплює всі форми психічної діяльності й зумовлює цілеспрямовану діяльність людини", "скрипторій": "Окреме приміщення-майстерня рукописних книжок у середньовічних західноєвропейських монастирях", "слов'янізм": "Слово або зворот, що ввійшли у східнослов'янські мови з церковнослов'янської", "службовець": "Співробітник, що здійснює підготовку й оформлення документації, облік та контроль, господарське обслуговування", "сміливість": "Хоробрість, відвага", "теледебати": "Дебати у вигляді телепрезентації чи телешоу", "термопаста": "Шар теплопровідного матеріалу між охолоджуваною поверхнею і пристроєм відведення тепла", "ультиматум": "Вимога пов'язана з обмеженням часу який даний на її виконання а також з погрозою серйозних наслідків у разі її невиконання", "ультразвук": "Звук, частота якого перевищує 20 кГц", "фактчекінг": "Діяльність з перевірки фактів", "формікарій": "Споруда для утримання мурах або штучний мурашник, зокрема для дослідницьких цілей", "фортепіано": "Струнний ударно-клавішний музичний інструмент сучасними різновидами якого є рояль і піаніно", "фоторюкзак": "Рюкзак для фототехніки", "хлібопекар": "Особа, заняттям, професією якої є випікання хліба", "хронологія": "Запис історичних подій в їх часовій послідовності", "цитоплазма": "Позаядерна частина протоплазми рослинних і тваринних клітин", "цитринівка": "Старовинний сорт груші народної селекції, що формою нагадує лимон", "ювелірство": "Ювелірне виробництво", "яйцекладка": "Відкладання запліднених яєць у зовнішнє середовище"};
        default:
            return {"помилка": "Упс, щось пішло не так! :/"};
    }
}

// Очікуємо завантаження вікна та запускаємо функцію
window.onload = function () {
    var boardElement;
    var wordList;
    var urlParams = new URLSearchParams(window.location.search);

    // Отримуємо розміри гри та значення slider2 з параметрів URL
    height = parseInt(urlParams.get('height')) || 6;
    width = parseInt(urlParams.get('width')) || 5;
    var slider2Value = parseInt(urlParams.get('slider2')) || 5;

    // console.log("Кількість ключів:", Object.keys(wordList).length);
    // console.log("Кількість значень:", Object.values(wordList).length);

    // Отримуємо словник слів для відповідності значення slider2
    wordList = getWordListBySliderValue(slider2Value);
    displayWordList(wordList);
    guessList = {};

    boardElement = document.getElementById("board");

    // Задаємо розміри дошки відповідно до параметрів гри
    if (boardElement) {
        boardElement.style.width = width * tileSize + "px";
        boardElement.style.height = height * tileSize + "px";
    }

    // Ініціалізуємо змінні для координат, стану гри та слова
    row = 0;
    col = 0;
    gameOver = false;

    // Копіюємо словник слів для подальшого відновлення
    guessList = Object.assign({}, guessList, wordList);
    let keys = Object.keys(wordList);
    word = keys[Math.floor(Math.random() * keys.length)].toUpperCase();
    // Ініціалізуємо гру
    initialize();
}

// Функція для створення гри та клавіатури
function initialize() {

    console.log("тут могла б бути ваша реклама");
    // console.log("Загадане слово: " + word);

    // Створюємо ігрову дошку
    for (let r = 0; r < height; r++) {
        for (let c = 0; c < width; c++) {
            let tile = document.createElement("span");
            tile.id = r.toString() + "-" + c.toString();
            tile.classList.add("tile");
            tile.innerText = "";
            document.getElementById("board").appendChild(tile);
        }
    }

    // Створюємо клавіатуру
    let keyboard = [
        ["Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ї"],
        ["Ф", "І", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Є", "'"],
        ["Enter", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю", "⌫"]
    ];

    for (let i = 0; i < keyboard.length; i++) {
        let currRow = keyboard[i];
        let keyboardRow = document.createElement("div");
        keyboardRow.classList.add("keyboard-row");
    
        for (let j = 0; j < currRow.length; j++) {
            let keyTile = document.createElement("div");
    
            let key = currRow[j];
            keyTile.innerText = key;
            keyTile.id = "Key" + key.toUpperCase();
            keyTile.addEventListener("click", function () {
                processKey(key);
            });
    
            // Додаємо класи для стилізації клавіш
            if (key == "Enter") {
                keyTile.classList.add("enter-key-tile");
            } else if (key == "Backspace") {
                keyTile.classList.add("backspace-key-tile");
            } else {
                keyTile.classList.add("key-tile");
            }
            keyboardRow.appendChild(keyTile);
        }
        document.body.appendChild(keyboardRow);
    }

    // Оброблюємо події натискання клавіші на клавіатурі
    document.addEventListener("keydown", function (e) {
        if (e.key === "Enter" || e.key === "Backspace") {
            e.preventDefault();
            processKey(e.key);
        } else {
            processKey(e.key.toUpperCase());
        }
    });
}

// Змінні для зберігання кількості спроб та стану гри
let attempts = 0;

// Функція для обробки натискання клавіші
function processKey(key) {
    if (gameOver) return;

    if (/^[А-ЩЬЮЯЇІЄҐ]$/.test(key.toUpperCase()) || key == " ' " || key == "'") {
        if (col < width) {
            let currTile = document.getElementById(row.toString() + '-' + col.toString());
            if (currTile.innerText == "") {
                currTile.innerText = key.toUpperCase();
                col += 1;
            }
        }
    } else if (key === "⌫" || key === "Backspace") {
        if (0 < col && col <= width) {
            col -= 1;
        }
        let currTile = document.getElementById(row.toString() + '-' + col.toString());
        currTile.innerText = "";
    } else if (key === "Enter") {
        update();

        // Виводимо загадане слово після завершення гри (перемога чи поразка)
        if (gameOver) {
            document.getElementById("answer").innerText = word;
            document.getElementById("definition").innerText = guessList[word.toLowerCase()];
        }
    }
}

// Функція для оновлення гри після введення спроби
function update() {
    document.getElementById("definition").innerText = "";

    let guess = "";
    document.getElementById("answer").innerText = "";

    // Зчитуємо введені літери
    for (let c = 0; c < width; c++) {
        let currTile = document.getElementById(row.toString() + '-' + c.toString());
        let letter = currTile.innerText;
        guess += letter;
    }

    guess = guess.toLowerCase();

    let lowerCaseGuess = guess.toLowerCase();
    // Перевіряємо, чи введене слово є в словнику слів
    if (!Object.keys(guessList).includes(lowerCaseGuess)) {
        document.getElementById("answer").innerText = "Вибачте, такого слова, поки що, немає в нашому словнику :(";
        return;
    }

    let correct = 0;
    let letterCount = {};

    // Підраховуємо кількість кожної літери в слові
    for (let i = 0; i < word.length; i++) {
        let letter = word[i];

        if (letterCount[letter]) {
            letterCount[letter] += 1;
        }
        else {
            letterCount[letter] = 1;
        }
    }

    // Перевіряємо введені літери і оновлюємо відповідно
    for (let c = 0; c < width; c++) {
        let currTile = document.getElementById(row.toString() + '-' + c.toString());
        let letter = currTile.innerText;

        if (word[c] == letter) {
            currTile.classList.add("correct");

            let keyTile = document.getElementById("Key" + letter);
            if (keyTile) {
                keyTile.classList.remove("present-key", "absent-key");
                keyTile.classList.add("correct-key");
            }

            correct += 1;
            letterCount[letter] -= 1;
        }

        if (correct == width) {
            // Виводимо повідомлення про перемогу
            document.getElementById("result").innerText = "Вітаю, ви перемогли!\nВи вгадали слово";
            document.getElementById("result").style.color = "#6AAA64"; 
            gameOver = true;
        }
    }

    // Перевіряємо решту введених літер і оновлюємо відповідно
    for (let c = 0; c < width; c++) {
        let currTile = document.getElementById(row.toString() + '-' + c.toString());
        let letter = currTile.innerText;

        if (!currTile.classList.contains("correct")) {
            if (word.includes(letter) && letterCount[letter] > 0) {
                currTile.classList.remove("absent");
                currTile.classList.add("present");

                let keyTile = document.getElementById("Key" + letter);
                if (keyTile) {
                    keyTile.classList.remove("absent-key");
                    keyTile.classList.add("present-key");
                }
                letterCount[letter] -= 1;
            } else {
                currTile.classList.remove("present");
                currTile.classList.add("absent");

                let keyTile = document.getElementById("Key" + letter);
                if (keyTile) {
                    keyTile.classList.remove("present-key", "correct-key");
                    keyTile.classList.add("absent-key");
                }
            }
        }
    }

    attempts += 1; // Ітеруємо спробу

    // Виводимо повідомлення про поразку, якщо досягнуто ліміт спроб і користувач не вгадав слово
    if (attempts >= height && !gameOver) {
        document.getElementById("result").innerText = "На жаль, ви програли :(\nЗагаданим словом було";
        document.getElementById("result").style.color = "#FF0000"; 
        document.getElementById("definition").innerText = guessList[lowerCaseGuess];
        document.getElementById("answer").innerText = word;
        gameOver = true;
    }

    row += 1;
    col = 0;
}

// Перезавантаження сторінки при кліку на кнопку з id "reloadButton"
document.addEventListener("DOMContentLoaded", function () {
    var reloadButton = document.getElementById("reloadButton");
    reloadButton.addEventListener("click", function () {
        location.reload();
    });
});

// Перемикання класу 'dark-theme' для темної теми при кліку на кнопку з id "darkThemeToggle"
document.addEventListener("DOMContentLoaded", function () {
    var darkThemeToggle = document.getElementById("darkThemeToggle");
    darkThemeToggle.addEventListener("click", function () {
        document.body.classList.toggle("dark-theme");
    });
});

// Обробка кліків на кнопках "reloadButton" та "darkThemeToggle" з врахуванням всплеску подій
document.addEventListener("DOMContentLoaded", function () {
    var reloadButton = document.getElementById("reloadButton");
    var darkThemeToggle = document.getElementById("darkThemeToggle");

    reloadButton.addEventListener("click", function () {
        location.reload();
    });

    darkThemeToggle.addEventListener("click", function (event) {
        event.stopPropagation();
        document.body.classList.toggle("dark-theme");
    });

    // Елементи для роботи з попапами
    var questionMark = document.querySelector(".fa-regular.fa-circle-question");
    var wordsListButton = document.querySelector(".button");
    var popup = document.getElementById("popup");
    var closePopup = document.getElementById("close-popup");
    var popupWordsList = document.getElementById("popupWordsList");
    var closePopupWordsList = document.getElementById("close-popup-words-list");
    var ignoreIcons = document.querySelectorAll(".navbar i, .fa-brands.fa-github, .fa-brands.fa-linkedin");

    // Функції для анімації попапів
    function togglePopup(popupElement, closeButton) {
        if (popupElement.style.display === "block") {
            closePopupHandler(popupElement);
        } else {
            openPopupHandler(popupElement);
        }
    }

    function openPopupHandler(popupElement) {
        popupElement.style.display = "block";
        popupElement.style.opacity = 0;
        popupElement.classList.add("show");

        setTimeout(function () {
            popupElement.style.opacity = 1;
        }, 50);
    }

    function closePopupHandler(popupElement) {
        popupElement.style.opacity = 0;
        popupElement.classList.remove("show");

        setTimeout(function () {
            popupElement.style.display = "none";
        }, 500);
    }

    // Обробка кліку на питання для відображення відповідного попапу та ігнорування інших
    questionMark.addEventListener("click", function (event) {
        event.stopPropagation();
        togglePopup(popup, closePopupWordsList);
        closePopupHandler(popupWordsList);
    });

    // Закриття попапа за допомогою кнопки "closePopup"
    closePopup.addEventListener("click", function () {
        closePopupHandler(popup);
    });

    // Обробка кліку на кнопці "wordsListButton" для відображення відповідного попапу та ігнорування інших
    wordsListButton.addEventListener("click", function (event) {
        event.stopPropagation();
        togglePopup(popupWordsList, closePopup);
        closePopupHandler(popup);
    });

    // Закриття попапа за допомогою кнопки "closePopupWordsList"
    closePopupWordsList.addEventListener("click", function () {
        closePopupHandler(popupWordsList);
    });

    // Закриття попапа при кліку поза ним або на певних іконках
    document.addEventListener("click", function (event) {
        var target = event.target;
        var isGitHubIcon = target.matches(".fa-brands.fa-github");
        var isLinkedInIcon = target.matches(".fa-brands.fa-linkedin");

        if (questionMark.contains(target) || isGitHubIcon || isLinkedInIcon) {
            return;
        }

        if (target === wordsListButton) {
            return;
        }

        closePopupHandler(popup);
    });

    // хз що це, може взагалі не треба
    function containsAny(target, elements) {
        return Array.from(elements).some(function (element) {
            return element.contains(target);
        });
    }
});

// Перемикання класу 'dark-theme' для темної теми при кліку на кнопці "darkThemeToggle"
document.addEventListener("DOMContentLoaded", function () {
    var darkThemeToggle = document.getElementById("darkThemeToggle");
    darkThemeToggle.addEventListener("click", function () {
        document.body.classList.toggle("dark-theme");
    });
});

// Відображення списку слів на сторінці
function displayWordList(wordList) {
    var wordListContent = document.getElementById("wordList-content");
    wordListContent.innerHTML = "";

    var wordListHTML = "<p>";
    var wordsArray = Object.keys(wordList);

    for (var i = 0; i < wordsArray.length; i++) {
        wordListHTML += wordsArray[i];

        if (i < wordsArray.length - 1) {
            wordListHTML += ", ";
        }
    }

    wordListHTML += "</p>";
    wordListContent.innerHTML = wordListHTML;
}
